In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['ram','hari','sita'],
    "city":['lalitpur','hattiban','satdobato'],
    "marks":[23,44,55]
}

In [3]:
df = pd.DataFrame(dict1)

In [4]:
df

   name       city  marks
0   ram   lalitpur     23
1  hari   hattiban     44
2  sita  satdobato     55

In [5]:
df.to_csv('friends.csv')

In [6]:
df.head(1)

  name      city  marks
0  ram  lalitpur     23

In [7]:
df.tail(2)

   name       city  marks
1  hari   hattiban     44
2  sita  satdobato     55

In [8]:
df.describe()

           marks
count   3.000000
mean   40.666667
std    16.258331
min    23.000000
25%    33.500000
50%    44.000000
75%    49.500000
max    55.000000

In [9]:
df["marks"]

0    23
1    44
2    55
Name: marks, dtype: int64

In [11]:
df["marks"][0] = 100

C:\Users\ACER\AppData\Local\Temp\ipykernel_4224\843445103.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["marks"][0] = 100

In [12]:
df.to_csv('friend.csv')

In [13]:
df

   name       city  marks
0   ram   lalitpur    100
1  hari   hattiban     44
2  sita  satdobato     55

In [16]:
df.index = ['first','second','third']

In [17]:
df

        name       city  marks
first    ram   lalitpur    100
second  hari   hattiban     44
third   sita  satdobato     55

In [18]:
df['city']

first      lalitpur
second     hattiban
third     satdobato
Name: city, dtype: object

In [19]:
df['marks']

first     100
second     44
third      55
Name: marks, dtype: int64